.config/emacs/init.org
#+PROPERTY: header-args :tangle "init.el" :mkdirp yes :noweb yes
#+STARTUP: overview

* Bootstrapping

#+begin_src elisp :tangle no
  (require 'org)
  (find-file (concat user-emacs-directory "init.org"))
  (org-babel-tangle)
  (load-file (concat user-emacs-directory "init.el"))
  (native-compile (concat user-emacs-directory "init.el"))
#+end_src

* Early init

#+name: early-init
#+begin_src elisp :tangle "early-init.el"
  ;;; -*- lexical-binding: t -*-
  (setq gc-cons-threshold most-positive-fixnum)
  (setq load-prefer-newer noninteractive)

  (defvar current-init-timestamp before-init-time)

  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars . nil) default-frame-alist)
  (push '(left-fringe . 12) default-frame-alist)
  (push '(right-fringe . 12) default-frame-alist)
  ;; (push '(internal-border-width . 15) default-frame-alist)
  ;; (push '(alpha-background . 80) default-frame-alist)

  (setq inhibit-startup-screen t)
  (setq initial-buffer-choice nil)
  (setq initial-major-mode 'fundamental-mode)

  (use-package use-package)
  (setq use-package-always-ensure t)
  (setq use-package-always-defer t)

  (setq user-emacs-directory (file-name-directory (file-truename load-file-name)))
  (setq custom-file (concat user-emacs-directory "custom.el"))

  (defun my/reset-after-init ()
    "Reset parameters used in early-init for faster startup to
    something reasonable."
    (setq gc-cons-threshold (* 16 1024 1024)))

  (add-hook 'after-init-hook #'my/reset-after-init)

  (declare-function my/config-emacs-faces nil)
  (add-to-list 'load-path (concat user-emacs-directory "lib"))
  (load-library "personal-lib")
  (my/config-emacs-faces)
#+end_src

* Personal functions

#+begin_src elisp :tangle "lib/personal-lib.el"
   ;;; -*- lexical-binding: t -*-
  (defun emacs-report-init-timestamp (mesg)
       (let* ((time (current-time))
	      (str (format "%f seconds"
			  (float-time (time-subtract time
						     current-init-timestamp)))))
	 (setq current-init-timestamp time)
	 (message "%s" (concat str " " mesg))))

  (defun my/try-xdg-open (filename)
    "Try to open file with xdg-open and return current buffer,
    otherwise apply `find-file-noselect'."
    (if (not (member (file-name-extension filename) my/xdg-open-extensions))
	(find-file-noselect filename)
      (browse-url-xdg-open (expand-file-name filename))
      t))

  (defun my/find-file-noselect-try-xdg (filename &optional wildcards)
    "If FILENAME is a directory, apply `find-file-noselect', otherwise
    expand wildcards and recursively apply `my/try-xdg-open'."
    (setq filename
	  (abbreviate-file-name
	   (expand-file-name filename)))
    (if (file-directory-p filename)
	(find-file-noselect filename)
      (if (and wildcards
	       find-file-wildcards
	       (not (file-name-quoted-p filename))
	       (string-match "[[*?]" filename))
	  (let ((files (condition-case nil
			   (file-expand-wildcards filename t)
			 (error (list filename))))
		(find-file-wildcards nil))
	    (if (null files)
		(my/try-xdg-open filename)
	      (mapcar #'my/try-xdg-open files)))
	(my/try-xdg-open filename))))

  (defun my/find-file-try-xdg (filename &optional wildcards)
    "The same as `find-file', except than if found FILENAMEs have an
    extension that is a member of `my/xdg-open-extensions' list, open
    them via xdg-open."
    (interactive
     (find-file-read-args "Find file: "
			  (confirm-nonexistent-file-or-buffer)))
    (let ((value (my/find-file-noselect-try-xdg filename wildcards)))
      (cond ((eq value t) nil)
	    ((listp value) (mapcar 'pop-to-buffer-same-window (nreverse (delq t value))))
	    (t (pop-to-buffer-same-window value)))))

  (defun my/emacs-popup-find-file ()
    "Call `find-file' in a pop-up minibuffer-only frame."
    (interactive)
    (call-process "bspc" nil nil nil "rule" "-a" "Emacs" "rectangle=")
    (call-process "bspc" nil nil nil "rule" "-a" "Emacs" "state=floating")
    (make-frame
     '((name . "<file-launcher>")
       (minibuffer . only)
       (width . 60)
       (height . 10)))
    (call-interactively #'my/find-file-try-xdg)
    (delete-frame (select-frame-by-name "<file-launcher>"))
    (call-process "bspc" nil nil nil "rule" "-a" "Emacs" "state=tiled"))

  (defun my/cdlatex-tab-backwards ()
    "`cdlatex-tab', but for backward movement"
    (interactive)
    (catch 'stop
      (while (re-search-backward "[ )}\n]\\|\\]" (point-min) t)
	(backward-char 1)
	(cond
	 ((= (following-char) ?\ )
	  ;; stop at first space or b-o-l
	  (if (not (bolp)) (forward-char 1)) (throw 'stop t))
	 ((= (following-char) ?\n)
	  ;; stop at line end, but not after \\
	  (if (and (bolp) (not (eobp)))
	      (throw 'stop t)
	    (if (equal "\\\\" (buffer-substring-no-properties
			       (- (point) 2) (point)))
		(forward-char 1)
	      (throw 'stop t))))
	 (t
	  ;; Stop before )}] if preceding-char is any parenthesis
	  (if (or (= (char-syntax (preceding-char)) ?\()
		  (= (char-syntax (preceding-char)) ?\))
		  (= (preceding-char) ?-))
	      (throw 'stop t)
	    (forward-char 1)
	    (if (looking-at "[^_^({\\[]")
		;; stop after closing bracket, unless ^_[{( follow
		(throw 'stop t))))))))

  (declare-function yas-expand nil)
  (defun my/yas-try-expanding-auto-snippets ()
    (when (and (boundp 'yas-minor-mode) yas-minor-mode)
      (let ((yas-buffer-local-condition ''(require-snippet-condition . auto)))
	(yas-expand))))

  (defun my/tangle-config ()
    "Tangle and compile my config file."
    (interactive)
    (when (buffer-file-name)
      (let ((prog-mode-hook nil)
	    (orgfile (file-truename (buffer-file-name))))
	(when (equal orgfile (file-truename (concat user-emacs-directory my/config)))
	  (let* ((prog-mode-hook nil)
		 (targets (org-babel-tangle-file orgfile)))
	    (dolist (target targets)
	      (byte-compile-file target)
	      (native-compile target)
	    targets))))))

  (declare-function cdlatex-number-of-backslashes-is-odd nil)
  (declare-function cdlatex--texmathp nil)
  (declare-function cdlatex-ensure-math nil)

  (defun my/sub-superscript (sub-superscript-char)
    "Insert ^{} or _{} unless the number of backslashes before point is odd.
    When not in LaTeX math environment, _{} and ^{} will have dollars.
    When pressed twice, make the sub/superscript roman."
    (interactive)
    (if (and cdlatex-make-sub-superscript-roman-if-pressed-twice
	     (equal this-command last-command))
	(progn
	  (insert "\\mathrm{}")
	  (backward-char 1))
      (if (cdlatex-number-of-backslashes-is-odd)
	  ;; Quoted
	  (insert sub-superscript-char)
	;; Check if we are in math mode, if not switch to or only add _ or ^
	(if (not (or (cdlatex--texmathp)
		     cdlatex-sub-super-scripts-outside-math-mode))
	    (insert sub-superscript-char)
	  (cdlatex-ensure-math)
	  ;; Insert the normal template.
	  (insert sub-superscript-char)
	  (insert "{}")
	  (forward-char -1)))))

  (defun my/latex-insert-alternate (text math)
    "Eval s-exp dependently on `texmathp' value."
    (if (texmathp)
	(eval math t)
      (eval text t)))
#+end_src

