.config/emacs/init.org
** Updating faces

#+begin_src elisp :tangle "lib/personal-lib.el"
  (defun my/config-display-line-numbers-faces ()
    "My faces configuration for `display-line-numbers-mode' minor mode."
    (dolist (face my/display-line-numbers-faces)
	(apply #'set-face-attribute face)))

  (defun my/config-font-lock-faces ()
    "My faces configuration for `font-lock-mode' minor mode."
    (dolist (face my/font-lock-faces)
      (apply #'set-face-attribute face)))

  (defun my/config-org-faces ()
    "My faces configuration for org-mode."
    (dolist (face my/org-faces)
      (apply #'set-face-attribute face)))

  (defun my/config-emacs-faces ()
    "My configuration for the built-in emacs faces."
    (dolist (face my/emacs-faces)
      (apply #'set-face-attribute face)))

  (defun my/update-faces ()
    "Load personal faces config."
    (dolist (update-function my/update-feature-face-functions)
      (when (featurep (car update-function))
	(funcall (cdr update-function)))))

  (defun my/toggle-themes ()
    "Call `modus-themes-toggle' and then `my/update-faces'."
    (interactive)
    (modus-themes-toggle)
    (my/update-faces))

  (defconst my/config "init.org"
    "Name of my emacs literate .org config file.")

  (defvar my/emacs-faces
    '((default nil
	       :font "JetBrainsMono Nerd Font Mono"
	       :height 100)
      (fixed-pitch nil
		   :font "JetBrainsMono Nerd Font Mono"
		   :height 100)
      (variable-pitch nil
		      :font "Merriweather"
		      :height 105
		      :weight regular
		      :width ultra-expanded)))

  (defvar my/org-faces
    '((org-default nil
		   :inherit 'variable-pitch)
      (org-block nil
		 :inherit 'fixed-pitch)
      (org-block-begin-line nil
			    :inherit 'font-lock-comment-face)
      (org-block-end-line nil
			  :inherit 'org-block-begin-line)))

  (defvar my/display-line-numbers-faces
    '((line-number nil
		   :inherit 'line-number
		   :font "JetBrainsMono Nerd Font Mono"
		   :height 100)))

  (defvar my/font-lock-faces
    '((font-lock-comment-face nil
			      :inherit 'font-lock-comment-face
			      :font "JetBrainsMono Nerd Font Mono"
			      :height 100
			      :slant italic)))

  (defvar my/update-feature-face-functions
    '((faces . my/config-emacs-faces)
      (font-core . my/config-font-lock-faces)
      (display-line-numbers . my/config-display-line-numbers-faces)
      (org . my/config-org-faces)))
#+end_src

* Package manager

#+begin_src elisp
  ;;; -*- lexical-binding: t -*-
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/") t)
#+end_src

* Emacs

#+begin_src elisp
  (autoload #'server-running-p "server")
  (unless (server-running-p)
    (server-start))

  (setq use-dialog-box nil)


  (savehist-mode)

  (recentf-mode)

  (global-auto-revert-mode)

  (defvar my/xdg-open-extensions
    (list "pdf" "mkv")
    "List of filename extensions which need to be opened via xdg-open.")

  (defconst dotfiles-user-emacs-dir
    (concat (getenv "HOME") "/.config/dotfiles/.config/emacs/"))

  (defvar personal-keybindings nil)
#+end_src

** Autosaves & Backups

#+begin_src elisp
  (setq auto-save-file-name-transforms
	'(("\\`/[^/]*:\\([^/]*/\\)*\\([^/]*\\)\\'" "/tmp/\\2" t)
	  (".*" "~/.config/emacs/.autosaves/" sha512)))

  (setq make-backup-files nil)
#+end_src

** Window management

#+begin_src elisp
  
#+end_src

** Keybindings

#+begin_src elisp
  (keymap-global-set "C-x C-f" #'my/find-file-try-xdg)
  (keymap-global-set "C-+" #'text-scale-increase)
  (keymap-global-set "C--" #'text-scale-decrease)

  (keymap-global-unset "C-z" t)
  (keymap-global-set "M-z" #'zap-to-char)
  (keymap-global-set "C-c n" #'notmuch)
  (keymap-global-set "C-h" #'delete-backward-char)

  ;; Org commands
  (keymap-global-set "C-c o l" #'org-store-link)
  (keymap-global-set "C-c o a" #'org-agenda)
  (keymap-global-set "C-c o c" #'org-capture)

  ;; Help
  (keymap-global-set "C-c h" 'help-command)
#+end_src

** Hooks

#+begin_src elisp
  (add-hook 'font-lock-mode-hook #'my/config-font-lock-faces)
  (add-hook 'display-line-numbers-mode-hook #'my/config-display-line-numbers-faces)
#+end_src

* Themes & fonts

** my theme

#+begin_src elisp
  (set-frame-parameter nil 'alpha-background 85)
  (add-to-list 'default-frame-alist '(alpha-background . 85))

  (use-package emacs
    :init
    (setq modus-themes-bold-constructs t
          modus-themes-italic-constructs t
          modus-themes-syntax '(alt-syntax)
          modus-themes-mode-line '(borderless accented)
          ;; modus-themes-fringes nil
          modus-themes-hl-line '(accented intense)
          modus-themes-subtle-line-numbers t
          modus-themes-paren-match '(bold)
          modus-themes-region '(accented bg-only))

    (set-fontset-font t 'han "Noto Sans CJK SC")
    (set-fontset-font t 'han "Noto Sans CJK TC" nil 'append)
    (set-fontset-font t 'symbol (font-spec :family "Noto Color Emoji") nil 'prepend) 
    :config
    (load-theme 'modus-vivendi)
    (my/update-faces))
#+end_src

** Text positioning

#+begin_src elisp
  ;; (use-package olivetti
  ;;   :defer t
  ;;   :functions elfeed-show-refresh
  ;;   :after elfeed
  ;;   :config
  ;;   (defun my/elfeed-show (buffer)
  ;;     (switch-to-buffer buffer)
  ;;     (olivetti-mode)
  ;;     (elfeed-show-refresh)))
#+end_src

* Snippets

#+begin_src elisp
  (use-package yasnippet
    :defer t
    :commands yas-minor-mode
    :config
    (setq yas-snippet-dirs '("~/.snippets"))
    (setq yas-triggers-in-field t)

    (declare-function yas-reload-all nil)
    (yas-reload-all)
    (add-hook 'LaTeX-mode-hook 'yas-minor-mode))
#+end_src

