.config/emacs/init.el
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/") t)

;;; -*- lexical-binding: t -*-
(autoload #'server-running-p "server")
(unless (server-running-p)
  (server-start))

(setq use-dialog-box nil)


(savehist-mode)

(recentf-mode)

(global-auto-revert-mode)

(defvar my/xdg-open-extensions
  (list "pdf" "mkv")
  "List of filename extensions which need to be opened via xdg-open.")

(defconst dotfiles-user-emacs-dir
  (concat (getenv "HOME") "/.config/dotfiles/.config/emacs/"))

(defvar personal-keybindings nil)

(keymap-global-set "C-x C-f" #'my/find-file-try-xdg)
(keymap-global-set "C-+" #'text-scale-increase)
(keymap-global-set "C--" #'text-scale-decrease)
(keymap-global-set "C-c l" #'org-store-link)
(keymap-global-set "C-c a" #'org-agenda)
(keymap-global-set "C-c c" #'org-capture)
(keymap-global-unset "C-z" t)
(keymap-global-set "M-z" #'zap-to-char)
(keymap-global-set "C-c n" #'notmuch)
(keymap-global-set "C-S-h" 'help-command)
(keymap-global-set "C-h" #'delete-backward-char)

(add-hook 'font-lock-mode-hook #'my/config-font-lock-faces)
(add-hook 'display-line-numbers-mode-hook #'my/config-display-line-numbers-faces)

;; (set-frame-parameter nil 'alpha-background 85)
;; (add-to-list 'default-frame-alist '(alpha-bakground . 85))

(use-package emacs
  :init
  (setq modus-themes-bold-constructs t
	modus-themes-italic-constructs t
	modus-themes-syntax '(alt-syntax)
	modus-themes-mode-line '(borderless accented)
	;; modus-themes-fringes nil
	modus-themes-hl-line '(accented intense)
	modus-themes-subtle-line-numbers t
	modus-themes-paren-match '(bold)
	modus-themes-region '(accented bg-only))

  (set-fontset-font t 'han "Noto Sans CJK SC")
  (set-fontset-font t 'han "Noto Sans CJK TC" nil 'append)
  (set-fontset-font t 'symbol (font-spec :family "Noto Color Emoji") nil 'prepend) 
  :config
  (load-theme 'modus-vivendi)
  (my/update-faces))

(use-package olivetti
  :defer t
  :functions elfeed-show-refresh
  :after elfeed
  :config
  (defun my/elfeed-show (buffer)
    (switch-to-buffer buffer)
    (olivetti-mode)
    (elfeed-show-refresh)))

(use-package yasnippet
  :defer t
  :commands yas-minor-mode
  :config
  (setq yas-snippet-dirs '("~/.snippets"))
  (setq yas-triggers-in-field t)

  (declare-function yas-reload-all nil)
  (yas-reload-all)
  (add-hook 'LaTeX-mode-hook 'yas-minor-mode))

(use-package tex
  :defer t
  :ensure auctex
