.config/emacs/lib/personal-lib.el

(defun my/config-display-line-numbers-faces ()
  "My faces configuration for `display-line-numbers-mode' minor mode."
  (dolist (face my/display-line-numbers-faces)
      (apply #'set-face-attribute face)))

(defun my/config-font-lock-faces ()
  "My faces configuration for `font-lock-mode' minor mode."
  (dolist (face my/font-lock-faces)
    (apply #'set-face-attribute face)))

(defun my/config-org-faces ()
  "My faces configuration for org-mode."
  (dolist (face my/org-faces)
    (apply #'set-face-attribute face)))

(defun my/config-emacs-faces ()
  "My configuration for the built-in emacs faces."
  (dolist (face my/emacs-faces)
    (apply #'set-face-attribute face)))

(defun my/update-faces ()
  "Load personal faces config."
  (dolist (update-function my/update-feature-face-functions)
    (when (featurep (car update-function))
      (funcall (cdr update-function)))))

(defun my/toggle-themes ()
  "Call `modus-themes-toggle' and then `my/update-faces'."
  (interactive)
  (modus-themes-toggle)
  (my/update-faces))

(defconst my/config "init.org"
  "Name of my emacs literate .org config file.")

(defvar my/emacs-faces
  '((default nil
	     :font "JetBrainsMono Nerd Font Mono"
	     :height 100)
    (fixed-pitch nil
		 :font "JetBrainsMono Nerd Font Mono"
		 :height 100)
    (variable-pitch nil
		    :font "Merriweather"
		    :height 105
		    :weight regular
		    :width ultra-expanded)))

(defvar my/org-faces
  '((org-default nil
		 :inherit 'variable-pitch)
    (org-block nil
	       :inherit 'fixed-pitch)
    (org-block-begin-line nil
			  :inherit 'font-lock-comment-face)
    (org-block-end-line nil
			:inherit 'org-block-begin-line)))

(defvar my/display-line-numbers-faces
  '((line-number nil
		 :inherit 'line-number
		 :font "JetBrainsMono Nerd Font Mono"
		 :height 100)))

(defvar my/font-lock-faces
  '((font-lock-comment-face nil
			    :inherit 'font-lock-comment-face
			    :font "JetBrainsMono Nerd Font Mono"
			    :height 100
			    :slant italic)))

(defvar my/update-feature-face-functions
  '((faces . my/config-emacs-faces)
    (font-core . my/config-font-lock-faces)
    (display-line-numbers . my/config-display-line-numbers-faces)
    (org . my/config-org-faces)))
