.config/emacs/init.org
* LaTeX

#+begin_src elisp
  (use-package tex
    :defer t
    :ensure auctex
    ;; :defines tex--prettify-symbols-alist
    :config
    (require 'org)
    (declare-function TeX-revert-document-buffer nil)
    (declare-function TeX-source-correlate-mode nil)

    (defun my/latex-setup ()
      "My configuration to LaTeX-mode"
      (setq TeX-command-extra-options "--synctex=1")

      ;; Modes
      (make-local-variable 'input-method-activate-hook)
      (add-hook 'input-method-activate-hook 'my/latex-cache-im nil t)
      (add-hook 'input-method-deactivate-hook 'my/latex-cache-im-deactivated nil t)
      (add-hook 'post-command-hook 'my/latex-im-autoswitch nil t)
      (add-hook 'post-self-insert-hook 'my/yas-try-expanding-auto-snippets nil t)

      (TeX-fold-mode t)
      (TeX-source-correlate-mode t)
      (display-line-numbers-mode t)

      (let ((my/tex-prettify-symbols-alist
	     '(( "\\left( " . ?\( )
	       ( " \\right)" . ?\) )
	       ( "\\left[ " . ?\[ )
	       ( " \\right]" . ?\] )
	       ( "\\left\\{ " . ?\{ )
	       ( " \\right\\}" . ?\} )
	       ( "\\left| " . ?\| )
	       ( " \\right|" . ?\| )
	       ( "\\left< " . ?\< )
	       ( " \\right>" . ?\> )
	       ( "\\mathrm{d}" . ?ꟈ)
	       ( "\\frac" . ?÷)
	       ( "\\limits" . ?|)
	       ( "\\left." . ?< )
	       ( "\\iint" . ?∬ )
	       ( "\\iiint" . ?∭ ))))
	(dolist (my/pretty my/tex-prettify-symbols-alist)
	  (add-to-list 'prettify-symbols-alist my/pretty)))
      (delete '("--" . 8211) prettify-symbols-alist)
      (prettify-symbols-mode t))
    (add-hook 'LaTeX-mode-hook 'my/latex-setup)
    (add-to-list 'TeX-view-program-list
		 '("my-pdf-viewer"
		   ("zathura-float %o"
		    ;; (mode-io-correlate
		    ;; " --synctex-forward %n:0:\"%(project-dir)tex/main.tex\" -x \"emacsclient +%{line} %{input}\""))
		    (mode-io-correlate " --synctex-forward %n:0:\"%b\" -x \"emacsclient +%{line} %{input}\""))
		   "zathura-float"))

    (add-to-list 'TeX-view-program-selection '(output-pdf "my-pdf-viewer"))

    (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer)

    ;; (setq TeX-electric-math '("\\(" . "\\)"))
    (setq TeX-source-correlate-start-server t)
    (setq auto-mode-alist (cons '("\\.tex$" . latex-mode) auto-mode-alist))
    (setq TeX-parse-self t)
    (setq japanese-TeX-error-messages nil)



    (use-package cdlatex
      :ensure t
      :hook (LaTeX-mode . turn-on-cdlatex)
      ;; :config
      ;; (setopt cdlatex-math-modify-prefix "C-S-z")
      ;; (setopt cdlatex-math-symbol-prefix "C-z")
      :bind (:map
	     cdlatex-mode-map
	     ("<tab>" . cdlatex-tab)
	     ("<backtab>" . my/cdlatex-tab-backwards)
	     ("C-z" . cdlatex-math-symbol)
	     ("C-S-z" . cdlatex-math-modify)
	     :map orgtbl-mode-map
	     ("<tab>" . lazytab-org-table-next-field-maybe))
      :config
      (load-file (concat user-emacs-directory "lazytab.el"))
      (require 'lazytab)
      (lazytab-mode t)

      (setq cdlatex-command-alist
	    '(
	      ("pd"		"Insert a partial derivative frac"
	       "\\frac{\\partial ?}{\\partial }" cdlatex-position-cursor nil nil t)
	      ("ppd"		"Insert a second order partial derivative frac (one var)"
	       "\\frac{\\partial^2 ?}{\\partial ^2}" cdlatex-position-cursor nil nil t)
	      ("ddd"		"Insert a second order full derivative frac (one var)"
	       "\\frac{\\mathrm{d}^2 ?}{\\mathrm{d} ^2}" cdlatex-position-cursor nil nil t)
	      ("pdpd"		"Insert a second order partial derivative frac (two vars)"
	       "\\frac{\\partial^2 ?}{\\partial \\partial }" cdlatex-position-cursor nil nil t)
	      ("dd"		"Insert a full derivative frac"
	       "\\frac{\\mathrm{d}?}{\\mathrm{d} }" cdlatex-position-cursor nil nil t)
	      ("fr"		"Insert \\frac{}{}"
	       "\\frac{ ? }{ }" cdlatex-position-cursor nil nil t)
	      ("equ*"		"Insert an EQUATION* environment template"
	       "" cdlatex-environment ("equation*") t nil)
	      ("ss*"		"Insert a \\subsection*{} statement"
	       "\\subsection*{?}" cdlatex-position-cursor nil t nil)
	      ("sss*"		"Insert a \\subsubsection*{} statement"
	       "\\subsubsection*{?}" cdlatex-position-cursor nil t nil)
	      ("отв"		"Insert my standard answer statement"
	       "\\paragraph{\\textbf{Ответ:}} $\\displaystyle ?$." cdlatex-position-cursor nil t nil)
	      ("seq"	"Insert a system of linear equations"
	       "\\begin{dcases}
	?
	\\end{dcases}" cdlatex-position-cursor nil nil t)
	      ("ceq"		"Insert a collection of linear equations"
	       "\\begin{sqdcases}
	?
	\\end{sqdcases}" cdlatex-position-cursor nil nil t)
	      ("prodl"		"Insert \\prod\\limits_{}^{}"
	       "\\prod\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
	      ("iintl"		"Insert \\iint\\limits_{}^{}"
	       "\\iint\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
	      ("iiintl"		"Insert \\iiint\\limits_{}^{}"
	       "\\iiint\\limits_{?}^{}" cdlatex-position-cursor nil nil t)
	      ("pmx"		"Insert pmatrix env"
	       "\\begin{pmatrix} ? \\end{pmatrix}" lazytab-position-cursor-and-edit nil nil t)))

      (setq cdlatex-math-symbol-alist
	    '(
	      ( ?\[ ("\\Leftarrow"      "\\Longleftarrow"	"\\hookleftarrow"))
	      ( ?\] ("\\Rightarrow"     "\\Longrightarrow"	"\\hookrightarrow"))))

      (setq cdlatex-math-modify-alist
	    '(
	      ( ?\] "\\text{?}" "$?$" nil nil nil)
	      ( ?l "\\left. ? \\right|" nil nil nil nil)))

      (define-key cdlatex-mode-map "/"
		  #'(lambda ()
		      (interactive)
		      (my/latex-insert-alternate '(insert "/") '(my/sub-superscript "^"))))
      (define-key cdlatex-mode-map "."
		  #'(lambda ()
		      (interactive)
		      (my/latex-insert-alternate '(insert ".") '(my/sub-superscript "_"))))
      (define-key cdlatex-mode-map "_"
		  #'(lambda ()
		      (interactive)
		      (my/latex-insert-alternate '(insert "_") '(insert "."))))
      (define-key cdlatex-mode-map "^"
		  #'(lambda ()
		      (interactive)
		      (my/latex-insert-alternate '(insert "^") '(insert "/"))))
      (keymap-set cdlatex-mode-map "C-`" #'prettify-symbols-mode))

    (defun my/latex-cache-im ()
      "Set (whether the point is in math mode) variables `my/latex-current-math-im'
	  or `my/latex-current-text-im' as freshly switched im"
      (when (eq major-mode 'latex-mode)
	(if (texmathp)
	    (setq my/latex-current-math-im current-input-method)
	  (setq my/latex-current-text-im current-input-method))))

    (defun my/latex-cache-im-deactivated ()
      "Set (whether the point is in math mode) variables `my/latex-current-math-im'
	  or `my/latex-current-text-im' as nil"
      (when (eq major-mode 'latex-mode)
	(if (texmathp)
	    (setq my/latex-current-math-im nil)
	  (setq my/latex-current-text-im nil))))

    (defun my/latex-im-autoswitch ()
      "Switch input method automatically based on whether is the point in math mode."
      (when (eq major-mode 'latex-mode)
	(if (texmathp)
	    (unless (string= current-input-method my/latex-current-math-im)
	      (activate-input-method my/latex-current-math-im))
	  (unless (string= current-input-method my/latex-current-text-im)
	    (activate-input-method my/latex-current-text-im))))))

  (defvar-local my/latex-current-text-im nil
    "Last im used in nonmath-mode in a LaTeX buffer")

  (defvar-local my/latex-current-math-im nil
    "Last im used in math-mode in a LaTeX buffer")
#+end_src

