.config/emacs/init.org
* EXPERIMENT

#+begin_src elisp
  ;; (defvar rattex--active-keymap 'rattex-mode-map)

  ;; (defvar rattex-track-size 10
  ;;   "Amount of tracked last inserted racks.")

  ;; (defvar rattex-derivative-keymap
  ;;   (let ((map (make-sparse-keymap)))
  ;;     (define-key map "M-d" #'rattex-insert-partial-derivative)
  ;;     map)
  ;;   "rattex keymap")

  ;; (defun rattex--insert-derivative (d-string)
  ;;   "Insert derivative with `d' as given string."
  ;;   (let ((start-point (point))
  ;; 	(end-point (point))
  ;; 	(d-length (length d-string)))
  ;;     (insert "\\frac{}{}")
  ;;     (backward-char 3)
  ;;     (insert (concat d-string " "))
  ;;     (forward-char 2)
  ;;     (insert (concat d-string " "))
  ;;     (backward-char (+ 3 d-length))
  ;;     (list 'start-point start-point
  ;; 	  'end-point end-point
  ;; 	  'rattex-rack-type 'rattex--partial)))

  ;; (defvar rattex-mode-map rattex-derivative-keymap
  ;;   "Keymap for rattex-mode")

  ;; (defun rattex-insert-partial-derivative ()
  ;;   "Insert a partial derivative."
  ;;   (interactive)
  ;;   (rattex--insert-derivative "\\partial"))

  ;; (defvar rattex--snippet-auto-p nil
  ;;   "Current state of autosnippet functionality.")

  ;; (defun rattex-snippet-toggle-auto ()
  ;;   "Toggle autosnippet functionality."
  ;;   (interactive)
  ;;   (if rattex--snippet-auto-p
  ;;       (remove-hook 'post-self-insert-hook 'rattex-snippet-try-expand)
  ;;     (add-hook 'post-self-insert-hook 'rattex-snippet-try-expand)))

  ;; (defvar rattex--snippet-table
  ;;   (make-hash-table
  ;;    :test 'equal
  ;;    :weakness nil
  ;;    :size 20
  ;;    :rehash-size 20
  ;;    :rehash-threshold 0.5))

  ;; (defun rattex-snippet-set-table (snippets-alist)
  ;;   "Create a snippet table from given list."
  ;;   (dolist (snippet snippets-alist)
  ;;     (puthash (car snippet) (cdr snippet) rattex--snippet-table)))

  ;; (defvar my/rattex-snippets
  ;;   (list
  ;;    '("pd" . (rattex-insert-partial-derivative . rattex-default-math-condition-p))))

  ;; (defun rattex-default-math-condition-p ()
  ;;   "Return t if char before the point is alphanumeric"
  ;;   (let ((inhibit-message t))
  ;;     (memq (get-char-code-property (char-before) 'general-category)
  ;; 	  '(Ll Lu Lo Lt Lm Nl Nd No))))

  ;; (defvar rattex-snippet-max-length 4
  ;;   "Maximum length of snippet key string.")

  ;; (defun rattex--snippet-try-key (key length)
  ;;   "Try to expand snippet from given key."
  ;;   (let ((action (gethash key rattex--snippet-table nil)))
  ;;     (if action
  ;; 	(progn
  ;; 	  (backward-char length)
  ;; 	  (if (funcall (cdr action))
  ;; 	      (forward-char length)
  ;; 	    (delete-char length)
  ;; 	    (funcall (car action))
  ;; 	    nil))
  ;;       t)))

  ;; (defun rattex-snippet-try-expand ()
  ;;   "Try to expand snippet at point"
  ;;   (interactive)
  ;;   (let ((move 1)
  ;; 	(key-end (point)))
  ;;     (while
  ;; 	(and
  ;; 	 (<= move rattex-snippet-max-length)
  ;; 	 (let* ((key-start (- key-end move))
  ;; 		(key (buffer-substring-no-properties key-start key-end)))
  ;; 	   (setq move (1+ move))
  ;; 	   (if (< key-start 1)
  ;; 	       nil
  ;; 	     (rattex--snippet-try-key key (- key-end key-start))))))))

  ;; (define-minor-mode rattex-mode
  ;;   "ne pridumal"
  ;;   :lighter "rttx")

  ;; (rattex-snippet-toggle-auto)
  ;; (rattex-snippet-set-table my/rattex-snippets)

  ;; (defconst rattrap-path (concat user-emacs-directory "pkgs/rattrap/"))
  ;; (use-package rattrap
  ;;   :ensure nil
  ;;   :demand t
  ;;   :load-path rattrap-path
  ;;   :config
  ;;   (defvar my/partiald-rat
  ;;     (list :action    #'ignore
  ;; 	  :condition #'rattrap-builtin-cond-alphanum
  ;; 	  :modifier  ?d
  ;; 	  :prefixes  '((?s ))))
  
  ;;   (defvar my/rattrap-latex-table
  ;;     (rattrap-make-table
  ;;      '(("pd" . my/partiald-rat)) )
#+end_src

* Elisp

#+begin_src elisp
  (define-key emacs-lisp-mode-map (kbd "M-q") #'lisp-fill-paragraph)
#+end_src

* Org

#+begin_src elisp
  (use-package org
    :defer t
    :ensure nil
    :init
    (add-hook 'org-mode-hook #'my/config-org-faces)
    :hook
    (org-mode . display-line-numbers-mode)
    :config
    ;; Modules
    (add-to-list 'org-modules 'org-habit t)

    (setq org-src-window-setup 'current-window)
    (setq org-startup-indented t)

    ;; Habits
    (setq org-habit-graph-column 50)

    ;; Todo
    (setq org-todo-keywords
          '((sequence "TODO" "DOING" "DONE")))

    ;; Logging
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)
    (setq org-agenda-start-with-log-mode t)


    (setq org-agenda-window-setup 'only-window)
    (setq org-agenda-restore-windows-after-quit t)

    (add-hook 'after-save-hook 'my/tangle-config))
#+end_src

* News, mail & web

#+begin_src elisp
  ;; Me!
  (setq user-full-name "Ratibor Siryi"
        user-mail-address "siryi.ra@phystech.edu")

  (use-package elfeed
    :defer t
    :config
    (setq elfeed-show-entry-switch 'my/elfeed-show)
    (setq elfeed-feeds
          '(("https://karthinks.com/index.xml" blog emacs)
            ("https://blogs.ams.org/mathgradblog/feed/" math)
            ("https://rsshub.app/telegram/channel/miptru" tgch mipt))))

  (use-package elpher
    :defer t)

  (use-package notmuch
    :defer t
    :init
    (setq mail-user-agent 'notmuch-user-agent)
    :config
    (setq notmuch-hello-sections
          '(notmuch-hello-insert-saved-searches
            notmuch-hello-insert-search
            notmuch-hello-insert-recent-searches
            notmuch-hello-insert-alltags)))

  (setq send-mail-function 'sendmail-send-it
        sendmail-program "msmtp"
        sendmail-coding-system 'utf-8-unix)
        ;; smtpmail-smtp-server "smtp.yandex.ru"
        ;; smtpmail-smtp-service 465
        ;; smtpmail-stream-type 'ssl
        ;; message-send-mail-function #'smtpmail-send-it)

  (use-package eww
    :ensure nil
    :config
    (setq browse-url-browser-function #'eww-browse-url))
#+end_src

* Input methods & typing

** ---
** Input methods

#+begin_src elisp
  (use-package rime
    :defer t)

  (defun input-method-set-default (im)
    "Set default input method"
    (interactive "sInput method: ")
    (let ((custom-input-method-alist '(("ru" . "russian-computer")
				       ("zh" . "rime"))))
      (setq default-input-method (cdr (assoc im custom-input-method-alist nil)))
      (message (cdr (assoc im custom-input-method-alist nil)))))

  (setq default-input-method "russian-computer")
#+end_src

** Language tools

#+begin_src elisp
  (use-package jinx
    :hook (org-mode text-mode LaTeX-mode)
    :config
    (setq jinx-languages "en_US ru_RU")
    (keymap-local-set "M-$" #'jinx-correct))
#+end_src

** Typing

#+begin_src elisp
  (use-package speed-type
    :defer t)
#+end_src

** ---

* Devtools & language modes

** ---

** Hare
#+begin_src elisp
  (use-package hare)
#+end_src
** Mathematica

#+begin_src elisp
  ;; (use-package wolfram-mode
  ;;   :config
  ;;   (setq wolfram-path "~/.Mathematica/Applications"
  ;; 	wolfram-program "wolframscript")
  ;;   (add-to-list 'auto-mode-alist '("\.wls$" . wolfram-mode)))

  (use-package xah-wolfram-mode
    :ensure nil
    :demand t
    :load-path "pkgs/xah-wolfram-mode/"
    :config
    (keymap-set xah-wolfram-mode-map "C-c C-c" #'xah-wolfram-run-script))
#+end_src

** Collaborative editing

#+begin_src elisp
  (use-package crdt)
#+end_src

** builtins

#+begin_src elisp
  (use-package electric
    :after prog-mode
    :hook ((prog-mode . electric-pair-mode)))

  (use-package prog-mode
    :ensure nil
    :hook
    (prog-mode . display-line-numbers-mode))
#+end_src

** Eglot

#+begin_src elisp
  (use-package eglot
    :defer t
    :ensure nil
    :hook
    (c++mode . eglot-ensure)
    :config
    (add-to-list 'eglot-server-programs
		 '((c-mode c++-mode)
		   . ("clangd"))))  
#+end_src

** VCS

#+begin_src elisp
  (use-package magit
    :defer t)
#+end_src

** Julia

#+begin_src elisp
  (use-package julia-mode
    :defer t)

  (use-package julia-repl
    :defer t)
#+end_src

** Yaml

#+begin_src elisp
  (use-package yaml-mode
    :defer t)
#+end_src

** Nix

#+begin_src elisp
  (use-package nix-mode
    :defer t)
#+end_src

** Common Lisp

#+begin_src elisp
  (use-package slime
    :defer t
    :config
    (setq inferior-lisp-program "sbcl"))
#+end_src

** Elixir
#+begin_src elisp
  (use-package elixir-mode)
#+end_src

** sxhkd

#+begin_src elisp
  (use-package sxhkdrc-mode
    :defer t
    :hook
    (sxhkdrc-mode . display-line-numbers-mode)
    :config
    (add-to-list 'auto-mode-alist `(,(rx "sxhkdrc" string-end) . sxhkdrc-mode)))
#+end_src

