.config/emacs/init.el

(use-package clang-format
  :defer t
  :config
  (declare-function my/clang-format-config nil)
  (defun my/clang-format-config ()
    "My clang-format config. I have an idea to create alternative
package for clang-format, because this one doesn't provide minor
mode and doing strange things with `org-babel-tangle'."
    (keymap-local-set "C-M-\\" #'clang-format-region)
    (keymap-local-set "C-i" #'clang-format)
    (add-hook 'before-save-hook #'clang-format-buffer nil t))

  (add-hook 'c-mode-hook #'my/clang-format-config)
  (add-hook 'c++-mode-hook #'my/clang-format-config))

(use-package gnuplot
  :defer t
  :config
  (autoload 'gnuplot-mode "gnuplot" "Gnuplot major mode" t)
  (autoload 'gnuplot-make-buffer "gnuplot" "open a buffer in gnuplot-mode" t)
  (setq auto-mode-alist (append '(("\\.gp$" . gnuplot-mode)) auto-mode-alist)))

(use-package company
  :hook prog-mode
  :config
  (setq company-idle-delay 0)
  (setq company-minimum-prefix-length 1))

(use-package rainbow-delimiters
  :defer t
  :after prog-mode
  :hook (prog-mode . rainbow-delimiters-mode))

(use-package markdown-mode)

;; Me
(setq-default fill-column 80)
(setq frame-resize-pixelwise t)
(column-number-mode 1)
(global-hl-line-mode t)
(add-to-list 'auto-mode-alist '("\\.txt$'" . text-mode))
(setenv "GPG_AGENT_INFO" nil)
(add-hook 'after-save-hook
	  'executable-make-buffer-file-executable-if-script-p)

(use-package vertico
  :demand t
  :config
  (vertico-mode))

(use-package marginalia
  :demand t
  :bind
  (:map minibuffer-local-map
	("M-a" . marginalia-cycle))
  :init
  (marginalia-mode))

(use-package orderless
  :demand t
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))

(use-package consult
  :demand t
  :bind
  (("C-c k" . consult-kmacro)
   ("C-c h" . consult-history)
   ("C-c m" . consult-man)
   ("C-c i" . consult-info)
   ("C-x b" . consult-buffer)
   ;; M-g bindings in `goto-map'
   ("M-g e" . consult-compile-error)
   ("M-g m" . consult-mark)
   ;; M-s bindings in `search-map'
   ("M-s G" . consult-grep)
   ("M-s g" . consult-git-grep)
   ("M-s d" . consult-find)
   )
  :init
  (setq xref-show-xrefs-function #'consult-xref))
(message (emacs-init-time))

(use-package exwm
  :init
  (require 'exwm-config))

(defun my/exwm-config ()
  "Jo Gay's exwm config"
  (setq exwm-workspace-number 10)
  (setq exwm-input-global-keys
	`((,(kbd "s-x") . my/exwm-launch-application)
	  (,(kbd "s-w") . exwm-workspace-switch)
	  (,(kbd "s-|") . exwm-reset)

	  (,(kbd "<XF86AudioMute>") . my/exwm-mute-volume)
	  (,(kbd "<XF86AudioRaiseVolume>") . my/exwm-raise-volume)
	  (,(kbd "<XF86AudioLowerVolume>") . my/exwm-lower-volume)))

  (setq exwm-input-simulation-keys
	`((,(kbd "C-b") . [left])
	  (,(kbd "C-f") . [right])
	  (,(kbd "C-p") . [up])
	  (,(kbd "C-n") . [down])
	  (,(kbd "C-a") . [home])
	  (,(kbd "C-e") . [end]))))

(defun my/exwm-mute-volume ()
  "Mute audio"
  (interactive)
  (start-process-shell-command "mute" nil "wpctl set-mute @DEFAULT_AUDIO_SINK@ toggle"))

(defun my/exwm-raise-volume ()
  "Raise volume"
  (interactive)
  (start-process-shell-command "raisev" nil "wpctl set-volume -l 1.5 @DEFAULT_AUDIO_SINK@ 5%+"))

(defun my/exwm-lower-volume ()
  "Lower volume"
  (interactive)
  (start-process-shell-command "lowerv" nil "wpctl set-volume @DEFAULT_AUDIO_SINK@ 5%-"))

(defun my/exwm-launch-application (command)
  (interactive (list (read-shell-command "jo gay: ")))
  (start-process-shell-command command nil command))

(my/exwm-config)
(exwm-enable)

(use-package dired
  :ensure nil
  :config
  (setq dired-create-destination-dirs 'always)
  (setq dired-create-destination-dirs-on-trailing-dirsep t))

;; (use-package minibuffer-line)
;; (use-package mini-modeline
;;   :config

;;   (setq mini-modeline-display-gui-line nil))

(use-package echo-bar)

(use-package eat)
